; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v8)
             (pred_1 ?v13 ?v9)
             (pred_12 ?v1 ?v9)
             (pred_8 ?v5 ?v1 )
	     (pred_5 ?v1)
             (pred_3 ?v6)
             (pred_6 ?v13)
             (pred_10 ?v9)
             (pred_11 ?v1)
             (pred_4 ?v13)
             (pred_9 ?v1)
             (pred_2 ))



(:action op_1
:parameters (?v10 ?v7 ?v2 ?v12)
:precondition (and (pred_3 ?v10) (pred_3 ?v7) (pred_6 ?v2) (pred_10 ?v12)
          (pred_7 ?v10 ?v7) (pred_1 ?v2 ?v12)
                   (pred_12 ?v7 ?v12) (pred_5 ?v10) 
                   (pred_11 ?v7) (pred_4 ?v2))
:effect (and  (pred_9 ?v7) (not (pred_11 ?v7))))


(:action op_2
:parameters (?v10 ?v11)
:precondition (and (pred_3 ?v10) (pred_3 ?v11)
               (pred_5 ?v10) (pred_7 ?v10 ?v11) (pred_9 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v10))))

(:action op_5
:parameters (?v10 ?v2)
:precondition (and (pred_3 ?v10) (pred_6 ?v2) 
                  (pred_5 ?v10) (pred_8 ?v2 ?v10) (pred_2 ))
:effect (and (pred_4 ?v2)
   (not (pred_8 ?v2 ?v10)) (not (pred_2 ))))


(:action op_3
:parameters (?v10 ?v3 ?v4)
:precondition (and (pred_3 ?v10) (pred_6 ?v3) (pred_6 ?v4)
                  (pred_5 ?v10) (pred_4 ?v4) (pred_8 ?v3 ?v10))
:effect (and (pred_4 ?v3) (pred_8 ?v4 ?v10)
        (not (pred_4 ?v4)) (not (pred_8 ?v3 ?v10))))

(:action op_4
:parameters (?v10 ?v2)
:precondition (and (pred_3 ?v10) (pred_6 ?v2) 
                  (pred_5 ?v10) (pred_4 ?v2))
:effect (and (pred_2 ) (pred_8 ?v2 ?v10) (not (pred_4 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_01 obj_14 obj_13 obj_11 obj_09 obj_07 obj_06 obj_03 obj_17 obj_20 obj_12 obj_15 obj_16 obj_10 obj_02
    obj_21 obj_04
    obj_18 obj_05 obj_08
    )

    (:init
       (pred_2)

       (pred_3 obj_19)
       (pred_3 obj_01)
       (pred_3 obj_14)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_12)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_10 obj_21)
       (pred_10 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_08)

       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_01 obj_09)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_14)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_01)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_07 obj_20)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_07)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_12  obj_02 obj_21)
       (pred_12  obj_12 obj_04)
       (pred_12  obj_14 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_13)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_10)

       (pred_1  obj_18 obj_21)
       (pred_1  obj_05 obj_04)
       (pred_1  obj_08 obj_21)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_08 obj_17)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_8 obj_18 obj_15)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_08 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_09)))
)
)

; plan
1. (op_2 obj_01 obj_19)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_19)
   goals met: 0 of 3
2. (op_2 obj_19 obj_11)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_11)
   goals met: 0 of 3
3. (op_5 obj_11 obj_05)
   deleted: (pred_8 obj_05 obj_11) (pred_2)
   added: (pred_4 obj_05)
   goals met: 0 of 3
4. (op_2 obj_11 obj_03)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_03)
   goals met: 0 of 3
5. (op_4 obj_03 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_2) (pred_8 obj_05 obj_03)
   goals met: 1 of 3
6. (op_2 obj_03 obj_17)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_17)
   goals met: 1 of 3
7. (op_5 obj_17 obj_08)
   deleted: (pred_8 obj_08 obj_17) (pred_2)
   added: (pred_4 obj_08)
   goals met: 1 of 3
8. (op_2 obj_17 obj_03)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_03)
   goals met: 1 of 3
9. (op_2 obj_03 obj_11)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_11)
   goals met: 1 of 3
10. (op_3 obj_11 obj_18 obj_08)
   deleted: (pred_4 obj_08) (pred_8 obj_18 obj_11)
   added: (pred_4 obj_18) (pred_8 obj_08 obj_11)
   goals met: 1 of 3
11. (op_2 obj_11 obj_03)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_03)
   goals met: 1 of 3
12. (op_2 obj_03 obj_15)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_15)
   goals met: 1 of 3
13. (op_4 obj_15 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_2) (pred_8 obj_18 obj_15)
   goals met: 2 of 3
14. (op_2 obj_15 obj_03)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_03)
   goals met: 2 of 3
15. (op_2 obj_03 obj_11)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_11)
   goals met: 2 of 3
16. (op_5 obj_11 obj_08)
   deleted: (pred_8 obj_08 obj_11) (pred_2)
   added: (pred_4 obj_08)
   goals met: 2 of 3
17. (op_2 obj_11 obj_19)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_19)
   goals met: 2 of 3
18. (op_2 obj_19 obj_01)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_01)
   goals met: 2 of 3
19. (op_1 obj_01 obj_14 obj_08 obj_21)
   deleted: (pred_11 obj_14)
   added: (pred_9 obj_14)
   goals met: 2 of 3
20. (op_2 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 2 of 3
21. (op_2 obj_14 obj_07)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_07)
   goals met: 2 of 3
22. (op_4 obj_07 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_2) (pred_8 obj_08 obj_07)
   goals met: 3 of 3
